Revit 2024 API
FamilyItemFactory.NewCurveByPoints Method
Create a 3d curve through two or more points in an Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurveByPoints NewCurveByPoints(
	ReferencePointArray points
)
Visual Basic
Public Function NewCurveByPoints ( _
	points As ReferencePointArray _
) As CurveByPoints
Visual C++
public:
CurveByPoints^ NewCurveByPoints(
	ReferencePointArray^ points
)
Parameters
points
Type: Autodesk.Revit.DB.ReferencePointArray
Two or more PointElements. The curve will interpolate these points.
Return Value
The newly created curve.
Examples
CopyC#
ReferencePointArray rpa = new ReferencePointArray();
XYZ xyz = document.Application.Create.NewXYZ(0, 0, 0);
ReferencePoint rp = document.FamilyCreate.NewReferencePoint(xyz);
rpa.Append(rp);
xyz = document.Application.Create.NewXYZ(0, 30, 10);
rp = document.FamilyCreate.NewReferencePoint(xyz);
rpa.Append(rp);
xyz = document.Application.Create.NewXYZ(0, 60, 0);
rp = document.FamilyCreate.NewReferencePoint(xyz);
rpa.Append(rp);
xyz = document.Application.Create.NewXYZ(0, 100, 30);
rp = document.FamilyCreate.NewReferencePoint(xyz);
rpa.Append(rp);
xyz = document.Application.Create.NewXYZ(0, 150, 0);
rp = document.FamilyCreate.NewReferencePoint(xyz);
rpa.Append(rp);
curve = document.FamilyCreate.NewCurveByPoints(rpa);
CopyVB.NET
Dim rpa As New ReferencePointArray()
Dim xyz As XYZ = document.Application.Create.NewXYZ(0, 0, 0)
Dim rp As ReferencePoint = document.FamilyCreate.NewReferencePoint(xyz)
rpa.Append(rp)
xyz = document.Application.Create.NewXYZ(0, 30, 10)
rp = document.FamilyCreate.NewReferencePoint(xyz)
rpa.Append(rp)
xyz = document.Application.Create.NewXYZ(0, 60, 0)
rp = document.FamilyCreate.NewReferencePoint(xyz)
rpa.Append(rp)
xyz = document.Application.Create.NewXYZ(0, 100, 30)
rp = document.FamilyCreate.NewReferencePoint(xyz)
rpa.Append(rp)
xyz = document.Application.Create.NewXYZ(0, 150, 0)
rp = document.FamilyCreate.NewReferencePoint(xyz)
rpa.Append(rp)
curve = document.FamilyCreate.NewCurveByPoints(rpa)
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when points is null.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when points does not contain at least two PointElements.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the family is not a Conceptual Mass Family.
See Also
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace